buzzwang1/pcb/source/main/STM32L433CCT/Mini/Test/BTR/BoardCtrl.h
#ifndef __BOARD_CONTROL_H__
#define __BOARD_CONTROL_H__


#include "TypeDef.h"
#include "stm32l433xx.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_rcc.h"
#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_utils.h"
#include "stm32l4xx_ll_cortex.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_dac.h"
#include "stm32l4xx_ll_exti.h"
#include "stm32l4xx_ll_rtc.h"
#include "stm32l4xx_ll_pwr.h"

#include "tGPPin.h"
#include "LED.h"
#include "cI2c.h"
#include "ina3221.h"

#include "cClock.h"
#include "ClockInfo.h"

#include "RomConst.h"

class cSystemPowerDown
{
public:
  virtual bool bContinue() = 0;           // Continue after PowerDown
  virtual bool bExitRun() = 0;            // 1. stage PowerDown. Should be used to inform connected devices to go to powerdown
  virtual bool bPreparePowerdown() = 0;   // 2. stage. Stop communication
  virtual bool bGotoPowerDown()   = 0;    // 3. goto powerdeon. Turn everything off, that is not needed.
                                          //    Bring everything to a defined/safe state
                                          //    Set WakeUp Sources

  virtual void vEnterPowerDown(u16 lu16WakeUpTime) = 0;
};


class cPowerManager
{
  public:
    typedef enum
    {
      nStIdle = 0,
      nStWaitForRun,
      nStWaitForExitRun,
      nStWaitForPreparePowerdown,
      nStWaitForGotoPowerDown
    }tenStates;

    typedef enum
    {
      nStInit = 0,
      nStRun,
      nStPreparePowerDown,
      nStWaitForPowerDown,
    }tenSysStates;

    typedef struct
    {
      u16 isWuTimerRtc : 1;
      u16 isWuStandBy : 1;
      u16 isWuPin1 : 1;
      u16 isWuPinRst : 1;
      u16 isWuSftRst : 1;
    }tstWakeupSources;

    typedef union
    {
      u16              u16WakeupSources;
      tstWakeupSources stWakeupSources;
    }tunWakeupSources;

    u16      mu16WakeUpTime;
    u16      mu16DRunTimer;
    u16      mu16DRunTimerReload;
    u16      mu16DExitRunTimer;
    u16      mu16DExitRunTimerReload;
    u16      mu16PreparePowerDownTimer;
    u16      mu16PreparePowerDownTimerReload;


    tunWakeupSources munWuSources;

    cSystemPowerDown* mcPowerDown;

    tenStates    enSm;
    tenSysStates enSysState;


    cPowerManager(u16 lu16DRunTimer,             u16 lu16DExitRunTimer,
                  u16 lu16PreparePowerDownTimer, u16 lu16WakeUpTime,
                  cSystemPowerDown* lcPowerDown)
    {
      enSm = nStIdle;
      enSysState = nStInit;

      mu16DRunTimer = lu16DRunTimer;
      mu16DRunTimerReload = mu16DRunTimer;
      mu16DExitRunTimer = lu16DExitRunTimer;
      mu16DExitRunTimerReload = mu16DExitRunTimer;
      mu16PreparePowerDownTimer = lu16PreparePowerDownTimer;
      mu16PreparePowerDownTimerReload = mu16PreparePowerDownTimer;

      mu16WakeUpTime = lu16WakeUpTime;

      mcPowerDown = lcPowerDown;

      vCheckWakeuUpSources();
    }

    void vContinueAdterWakeup()
    {
      if (mcPowerDown->bContinue())
      {
        enSm = nStWaitForRun;
        vStart();
      }
    }

    void vCheckWakeuUpSources()
    {
      munWuSources.u16WakeupSources = 0;

      // Wakeup Timer RTC
      if (LL_RTC_IsActiveFlag_WUT(RTC))
      {
        /* Reset RTC Internal Wake up flag */
        LL_RTC_DisableWriteProtection(RTC);

        LL_RTC_ClearFlag_WUT(RTC);
        /* Disable wake up timer to modify it */
        LL_RTC_WAKEUP_Disable(RTC);
        LL_RTC_DisableIT_WUT(RTC);

        LL_RTC_EnableWriteProtection(RTC);

        munWuSources.stWakeupSources.isWuTimerRtc = True;
      }

      /* Check if the system was resumed from Standby mode */
      if (__HAL_PWR_GET_FLAG(PWR_FLAG_SB))
      {
        /* Clear Standby flag */
        __HAL_PWR_CLEAR_FLAG(PWR_FLAG_SB);
        munWuSources.stWakeupSources.isWuStandBy = True;
      }

      if (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF1))
      {
        /* Clear Standby flag */
        __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WUF1);
        munWuSources.stWakeupSources.isWuPin1 = True;
      }

      // RCC_FLAG_LSERDY   LSE oscillator clock ready
      // RCC_FLAG_LSECSSD  Clock security system failure on LSE oscillator detection
      // RCC_FLAG_LSIRDY   LSI oscillator clock ready
      // RCC_FLAG_BORRST   BOR reset
      // RCC_FLAG_OBLRST   OBLRST reset
      // RCC_FLAG_PINRST   Pin reset
      // RCC_FLAG_FWRST    FIREWALL reset
      // RCC_FLAG_SFTRST   Software reset
      // RCC_FLAG_IWDGRST  Independent Watchdog reset
      // RCC_FLAG_WWDGRST  Window Watchdog reset
      // RCC_FLAG_LPWRRST  Low Power reset
      if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST)) {munWuSources.stWakeupSources.isWuPinRst = True;}
      if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST)) {munWuSources.stWakeupSources.isWuSftRst = True;}

      __HAL_RCC_CLEAR_RESET_FLAGS();
    }


    void vStart()
    {
      if ((enSm == nStIdle) || (enSm == nStWaitForRun))
      {
        mu16DRunTimer             = mu16DRunTimerReload;
        mu16DExitRunTimer         = mu16DExitRunTimerReload;
        mu16PreparePowerDownTimer = mu16PreparePowerDownTimerReload;
        enSm = nStWaitForRun;
      }
    }

    void vTick10ms()
    {
      bool lbLoop = True;

      while (lbLoop)
      {
        lbLoop = False;
        switch (enSm)
        {
          case nStIdle:
            break;
          case nStWaitForRun:
            enSysState = nStRun;

            if (mu16DRunTimer)
            {
              mu16DRunTimer--;
            }
            else
            {
              if (mcPowerDown->bExitRun())
              {
                enSm = nStWaitForExitRun;
              }
            }
            break;
          case nStWaitForExitRun:
            if (mu16DExitRunTimerReload)
            {
              mu16DExitRunTimerReload--;
            }
            else
            {
              enSysState = nStPreparePowerDown;
              if (mcPowerDown->bPreparePowerdown())
              {
                enSm = nStWaitForPreparePowerdown;
              }
            }
            break;
          case nStWaitForPreparePowerdown:
            if (mu16PreparePowerDownTimer)
            {
              mu16PreparePowerDownTimer--;
            }
            else
            {
              enSysState = nStWaitForPowerDown;
              if (mcPowerDown->bGotoPowerDown())
              {
                enSm = nStWaitForGotoPowerDown;
                lbLoop = True;
              }
            }
            break;
          case nStWaitForGotoPowerDown:

            mcPowerDown->vEnterPowerDown(mu16WakeUpTime);

            if (mcPowerDown->bContinue())
            {
              enSm = nStWaitForRun;
              vStart();
            }
            break;
          default:
            break;
        }
      }
    }
};



class cWorkMode
{
  public:

