buzzwang1/pcb/source/main/STM32L433CCT/Mini/Test/BTR/BoardCtrl.h
  typedef enum
  {
    nStManuel,
    nStAuto,
  }tenState;

  tenState mMode;
  u16      mCounter;

  cWorkMode()
  {
    mCounter = 0;
    vSet(cWorkMode::nStAuto);
  }

  void vSet(cWorkMode::tenState lMode)
  {
    mMode = lMode;
    if (mMode == cWorkMode::nStManuel)
    {
      mCounter = 60*10; // 10min
    }
  }

  bool IsAuto()
  {
    return (mMode == cWorkMode::nStAuto);
  }

  void vTick1000ms()
  {
    if (mCounter)
    {
      mCounter--;
      if (mCounter == 0)
      {
        vSet(cWorkMode::nStAuto);
      }
    }
  }

  const char* ToString()
  {
    if (mMode == cWorkMode::nStManuel)
    {
      return (const char*)"manuel";
    }
    else
    {
      return (const char*)"auto";
    }
  }
};

template <const uintptr_t mpstPort, const uint16 mui16Pin>
class cStatusLed : public LED<mpstPort, mui16Pin>
{
  public:

  typedef enum
  {
    nStToggle100ms,
    nStToggle200ms,
    nStToggle500ms,
    nStToggle1000ms,
    nStPuls500ms,
    nStPuls1000ms,
  }tenState;

  tenState mSm;
  u8       mCounter;

  cStatusLed()
   : LED<mpstPort, mui16Pin>()
  {
    mSm = nStToggle500ms;
    mCounter = 0;
  };

  void vReInit()
  {
    LED<mpstPort, mui16Pin>::vReInit();
    mSm = nStToggle500ms;
    mCounter = 0;
  }

  void vSetMode(tenState lSm)
  {
    mSm = lSm;
  }


  void vTick100ms()
  {
    switch (mSm)
    {
      case nStToggle100ms:
        this->Toggle();
        break;
      case nStToggle200ms:
        if (mCounter & 1)
        {
          this->Toggle();
        }
        break;
      case nStToggle500ms:
        if ((mCounter == 0) || (mCounter == 5))
        {
          this->Toggle();
        }
        break;
      case nStToggle1000ms:
        if (mCounter == 0)
        {
          this->Toggle();
        }
        break;
      case nStPuls500ms:
        if ((mCounter == 0) || (mCounter == 5))
        {
          this->On();
        }
        else
        {
          this->Off();
        }
        break;
      case nStPuls1000ms:
        if (mCounter == 0)
        {
          this->On();
        }
        else
        {
          this->Off();
        }
        break;
    }

    if (mCounter < 10)
    {
      mCounter++;
    }
    else
    {
      mCounter = 0;
    }
  }
};


class cDigiPower
{
  public:

  enum
  {
    nPin1 = 10
  };

  //Digi Power
  cGpPin lcDigi1;

  cDigiPower(u8 lu8InitState = 0)
  : lcDigi1(GPIOA_BASE, nPin1, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, lu8InitState)
  {
  }

  void vPowerOn()
  {
    GPIOA->BSRR = (1 << nPin1);
  }

  void vPowerOff()
  {
    GPIOA->BRR = (1 << nPin1);
  }
};

class cAnalogConvert
{
public:

  static u16 u16GetValue(u16 lu16Cnt, const u16* lu16CalDigi, const u16* lu16CalValue, u16 lu16Digi)
  {
    u16 lu16Digi1, lu16Digi2;
    u16 lu16Value1, lu16Value2;
    float lfZwerg;

    //Nächaten Punkt in der Tabelle suchen
    u16 lu16t = lu16Cnt / 2;


    while (1)
    {
      if ((lu16Digi >= lu16CalDigi[lu16t]) && (lu16Digi < lu16CalDigi[lu16t + 1]))
      {
        break;
      }
      else
        if (lu16Digi >= lu16CalDigi[lu16t])
        {
          if (lu16t < (lu16Cnt - 1))
          {
            lu16t++;
          }
          else
          {
            break;
          }
        }
        else // (lu16Digi < lu16CalDigi[lu16t])
        {
          if (lu16t > 0)
          {
            lu16t--;
          }
          else
          {
            break;
          }
        }
    }

    lu16Digi1 = lu16CalDigi[lu16t];  lu16Digi2 = lu16CalDigi[lu16t + 1];
    lu16Value1 = lu16CalValue[lu16t]; lu16Value2 = lu16CalValue[lu16t + 1];

    lfZwerg = (float)(lu16Value2 - lu16Value1) / (float)(lu16Digi2 - lu16Digi1);
    lfZwerg *= (float)(lu16Digi - lu16Digi1);
    if (lfZwerg > 0) lfZwerg += 0.5f;
                else lfZwerg -= 0.5f;
    return (u16)((i16)lfZwerg + lu16Value1);
  }

  static u16 u16GetDigi(u16 lu16Cnt, const u16* lu16CalDigi, const u16* lu16CalValue, u16 lu16Value)
  {
    u16 lu16Digi1, lu16Digi2;
    u16 lu16Value1, lu16Value2;
    float lfZwerg;

    //Nächaten Punkt in der Tabelle suchen
    u16 lu16t = lu16Cnt / 2;


    while (1)
    {
      if ((lu16Value >= lu16CalValue[lu16t]) && (lu16Value < lu16CalValue[lu16t + 1]))
      {
        break;
      }
      else
        if (lu16Value >= lu16CalValue[lu16t])
        {
          if (lu16t < (lu16Cnt - 1))
          {
            lu16t++;
          }
          else
          {
            break;
          }
        }
        else // (lu16Digi < lu16CalValue[lu16t])
        {
          if (lu16t > 0)
          {
            lu16t--;
          }
          else
          {
            break;
          }
        }
    }

    lu16Digi1 = lu16CalDigi[lu16t];  lu16Digi2 = lu16CalDigi[lu16t + 1];
    lu16Value1 = lu16CalValue[lu16t]; lu16Value2 = lu16CalValue[lu16t + 1];

    lfZwerg =  (float)(lu16Digi2 - lu16Digi1) / (float)(lu16Value2 - lu16Value1);
    lfZwerg *= (float)(lu16Value - lu16Value1);
    if (lfZwerg > 0) lfZwerg += 0.5f;
                else lfZwerg -= 0.5f;
    return (u16)((i32)lfZwerg + lu16Digi1);
  }
};


class cVoltageConverter
{
  public:
    u16 mVoltage_mV;
    bool mbEnable;

  cVoltageConverter()
  {
    __HAL_RCC_DAC1_CLK_ENABLE();
    mVoltage_mV = 0;
    mbEnable = False;
  }

  virtual void vSetVoltage(u16 lu16Value) = 0;
  u16  u16GetVoltage()
  {
    return mVoltage_mV;
  }

  virtual void vEnable() = 0;
  virtual void vDisable() = 0;

  bool isEnable()
  {
    return mbEnable;
  }
};

class cVoltageConverterIn : public cVoltageConverter
{
  public:
  // PA4 DAC1 Channel1
  // PB8 Enable

  enum
  {
    nPinEn = 7
  };

  cVoltageConverterIn(u16 lu16Value)
    :cVoltageConverter()
  {
    cGpPin mDac(GPIOA_BASE, 4, GPIO_MODE_ANALOG, GPIO_NOPULL, GPIO_SPEED_FREQ_HIGH, 0);
    cGpPin mEnable(GPIOA_BASE, nPinEn, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 1 /* In-Converter default an */);
    mbEnable = True;

    LL_DAC_InitTypeDef DAC_InitStructure;

    /* DAC channel1 Configuration */
    LL_DAC_StructInit(&DAC_InitStructure);
    DAC_InitStructure.OutputBuffer = LL_DAC_OUTPUT_BUFFER_ENABLE; // Enable, sonst bricht die ausgangsspannung zusammen
    LL_DAC_Init(DAC1, LL_DAC_CHANNEL_1, &DAC_InitStructure);
    mVoltage_mV = lu16Value;
    LL_DAC_ConvertData12RightAligned(DAC1, LL_DAC_CHANNEL_1, u16VoltToDigit(mVoltage_mV));
    LL_DAC_Enable(DAC1, LL_DAC_CHANNEL_1);
  }

