buzzwang1/pcb/source/main/STM32L433CCT/Mini/Test/BTR/BoardCtrl.h
  void vSetVoltage(u16 lu16Value) override
  {
    mVoltage_mV = lu16Value;
    LL_DAC_ConvertData12RightAligned(DAC1, LL_DAC_CHANNEL_1, u16VoltToDigit(mVoltage_mV));
  }

  u16 u16VoltToDigit(u16 lu16Value)
  {
    lu16Value = cAnalogConvert::u16GetDigi(17, RomConst_stDevice_Info->u16Calib_Digi_PowerIn, RomConst_stDevice_Info->u16Calib_Uout_PowerIn, lu16Value);

    if (lu16Value > 4095) lu16Value = 4095;
    return (u16)lu16Value;
  }


  void vEnable() override
  {
    GPIOA->BSRR = (1 << nPinEn);
    mbEnable = True;
  }

  void vDisable() override
  {
    GPIOA->BRR = (1 << nPinEn);
    mbEnable = False;
  }
};

class cVoltageConverterOut : public cVoltageConverter
{
public:
  // PA5  DAC1 Channel2
  // PA15 Enable

  enum
  {
    nPinEn = 8
  };


  cVoltageConverterOut(u16 lu16Value)
  {
    cGpPin mDac(GPIOA_BASE, 5, GPIO_MODE_ANALOG, GPIO_NOPULL, GPIO_SPEED_FREQ_HIGH, 0);
    cGpPin mEnable(GPIOB_BASE, nPinEn, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);

    LL_DAC_InitTypeDef DAC_InitStructure;

    /* DAC channel1 Configuration */
    LL_DAC_StructInit(&DAC_InitStructure);
    DAC_InitStructure.OutputBuffer = LL_DAC_OUTPUT_BUFFER_ENABLE; // Enable, sonst bricht die ausgangsspannung zusammen
    LL_DAC_Init(DAC1, LL_DAC_CHANNEL_2, &DAC_InitStructure);
    mVoltage_mV = lu16Value;
    LL_DAC_ConvertData12RightAligned(DAC1, LL_DAC_CHANNEL_2, u16VoltToDigit(mVoltage_mV));
    LL_DAC_Enable(DAC1, LL_DAC_CHANNEL_2);
  }

  void vSetVoltage(u16 lu16Value) override
  {
    mVoltage_mV = lu16Value;
    LL_DAC_ConvertData12RightAligned(DAC1, LL_DAC_CHANNEL_2, u16VoltToDigit(mVoltage_mV));
  }

  u16 u16VoltToDigit(u16 lu16Value)
  {
    u32 lu32Value = ((u32)(12000 - lu16Value) * 267) / 1000;
    if (lu32Value > 4095) lu32Value = 4095;
    return (u16)lu32Value;
  }

  void vEnable() override
  {
    GPIOB->BSRR = (1 << nPinEn);
    mbEnable = True;
  }

  void vDisable() override
  {
    GPIOB->BRR = (1 << nPinEn);
    mbEnable = False;
  }
};


class cLipoMon
{
public:

  typedef enum
  {
    enS1_Lipo  = 0,

    enS_Balancer_Lipo1,
    enS_Balancer_Lipo2,
    enS_Balancer_Lipo3,
    enS_Balancer_Lipo4,

    enINA_P1 = 0,
    enINA_P2 = 1,
  }tenLipoMonGeneral;

  typedef enum
  {
    enSmStNotCharging,
    enSmStNotCharging_Error_LowInputVoltage,
    enSmStNotCharging_Error_CellsDefect,
    enSmStChargingSave,
    enSmStChargingNormal,
    enSmStCharged
  }tenLipoMonLipo_States;


  typedef enum
  {
    enSmStOff = 0,
    enSmStOn
  }tenLipoMonS_States;

  typedef enum
  {
    enSmEvInit = 0,
    enSmEvOff,
    enSmEvOn,
    enSmEvAuto
  }tenLipoMonS_Events;

  typedef enum
  {
    enLipoUThres1 = 3200,
    enLipoUThres2 = 3500,
    enLipoUThres3 = 3800,
    enLipoUThres4 = 4200, // 16600 * 4 =

    //Strom in mA
    enLipoISave   = 25,
    enLipoI100mA  = 100,
    enLipoICharge = enLipoI100mA,

    enPowerInIMax = 500,

  }tenLipoMonS_Const;


  cI2cMaster* mcI2C;

  cINA3221* mcP[2];
  // mcP[0] = Adr 0x40
  //  Kanal11: Eingang  (Vor Charger)
  //  Kanal12: Batterie/System (Nach Charger); Spannung Bat4 + Spannungsabfall am Widerstand über Bat 4
  //  Kanal13: Ausgang (Nach Ausgangs Konverter)
  //
  // mcP[1] = Adr 0x41
  //  Kanal21: Spannung an Bat3
  //  Kanal22: Spannung an Bat2
  //  Kanal23: Spannung an Bat1

  int32  mi32VBus[6];
  float  mfVBusAvg[6];
  int32  mi32IShunt[6];
  float  mfIShuntAvg[6];
  int32  mi32VShunt[6];
  float  mfVShuntAvg[6];

  float  mfVBat[4];

  uint8 mui8P2Mode;

  u16                   mBalancingActive;
  u16                   mu16UnderVoltageCnt[4];
  u16                   mu16OverVoltageCnt[4];

  tenLipoMonS_States    lenSmS[5];
  tenLipoMonLipo_States lenSmLipo;
  tenLipoMonLipo_States lenSmLipoPrev;

  int32  mi32LipoChargeSum_10ms;
  uint32 mui32LipoChargeTime_10ms;

  uint32   mui32LipoChargeCount1;
  uint32   mui32LipoChargeCount2;
  uint32   mui32LipoLoadCount;

  uint32   mu32ChargerReadyCnt;

  int32    mi32LipoCap;
  int32    mi32LipoCapMax;

  u16   mu16Startup_Delay;

  bool  mbPowerDown;
  bool  mbPowerDownEnter;

  tcGpPin<GPIOC_BASE, 13> mS_Lipo;
  tcGpPin<GPIOB_BASE,  0> mS_BalancerLipo1;
  tcGpPin<GPIOA_BASE,  6> mS_BalancerLipo2;
  tcGpPin<GPIOB_BASE,  2> mS_BalancerLipo3;
  tcGpPin<GPIOA_BASE, 15> mS_BalancerLipo4;

  cVoltageConverterIn  mcPowerIn;
  cVoltageConverterOut mcPowerOut;

  cLipoMon(cI2cMaster* lcI2C)
    : mS_Lipo(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 1),
      mS_BalancerLipo1(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0),
      mS_BalancerLipo2(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0),
      mS_BalancerLipo3(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0),
      mS_BalancerLipo4(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0),
      mcPowerIn(10000), mcPowerOut(6000)
  {
    mcI2C = lcI2C;

    mcP[0] = new cINA3221(mcI2C, INA3221_I2C_ADDRESS_CONF_0, 50, 50, 50);
    mcP[1] = new cINA3221(mcI2C, INA3221_I2C_ADDRESS_CONF_1, 50, 50, 50);


    u8 lui8t;

    mu16Startup_Delay = 1000; //[ms]

    lenSmLipo = enSmStNotCharging;
    lenSmLipoPrev = lenSmLipo;

    mi32LipoChargeSum_10ms = 0;
    mui32LipoChargeTime_10ms = 0;

    mui32LipoChargeCount1 = 0;
    mui32LipoChargeCount2 = 0;
    mui32LipoLoadCount = 0;
    mu32ChargerReadyCnt = 0;

    mi32LipoCap = 0;
    mi32LipoCapMax = 0;

    mui8P2Mode = 0;
    mBalancingActive = 0;

    for (lui8t = 0; lui8t <= 1; lui8t++)
    {
      mcP[lui8t]->i8Setup();
    }
    for (lui8t = 0; lui8t < 6; lui8t++)
    {
      mi32VBus[lui8t] = 0;
      mi32IShunt[lui8t] = 0;
      mi32VShunt[lui8t] = 0;
    }


    lenSmS[enS1_Lipo] = enSmStOn;
    lenSmS[enS_Balancer_Lipo1] = enSmStOff;
    lenSmS[enS_Balancer_Lipo2] = enSmStOff;
    lenSmS[enS_Balancer_Lipo3] = enSmStOff;
    lenSmS[enS_Balancer_Lipo4] = enSmStOff;

    for (lui8t = 0; lui8t < 4; lui8t++)
    {
      mu16UnderVoltageCnt[lui8t] = 0;
      mu16OverVoltageCnt[lui8t]  = 0;
    }

    mbPowerDown = False;
    mbPowerDownEnter = False;
  }

  bool bPowerDown()
  {
    bool lbRet = True;


    // Während Laden nicht runterfahren.
    if ((lenSmLipo == enSmStChargingNormal) ||
        (lenSmLipo == enSmStChargingSave))
    {
      lbRet = False;
    }


