buzzwang1/pcb/source/main/STM32L433CCT/Mini/Test/BTR/BoardCtrl.h
    // Während Output an, nicht runterfahren.
    if (mcPowerOut.isEnable())
    {
      lbRet = False;
    }

    if (lbRet)
    {
      mbPowerDown = True;
      mbPowerDownEnter = True;
    }

    return lbRet;
  }


  i16 i16GetBatVoltageAbs(u8 lu8Idx)
  {
    return (i16)fGetBatVoltageAbs(lu8Idx);
  }


  float fGetBatVoltageAbs(u8 lu8Idx)
  {
    float lfValue = 0;
    switch (lu8Idx)
    {
      // Wert verkleinern, verkleinert den ADC wert
      case 1: lfValue = mfVBusAvg[5] + 4; break; // +4 wegen Mosfet spannungsabfall
      case 2: lfValue = mfVBusAvg[4];     break;
      case 3: lfValue = mfVBusAvg[3];     break;
      case 4: lfValue = mfVBusAvg[1] - mfVShuntAvg[1]; break;
    }
    return lfValue;
  }


  i16 i16GetBatVoltageRel(u8 lu8Idx)
  {
    return (i16)fGetBatVoltageRel(lu8Idx);
  }

  float fGetBatVoltageRel(u8 lu8Idx)
  {
    switch (lu8Idx)
    {
      case 1: mfVBat[lu8Idx - 1] = fGetBatVoltageAbs(lu8Idx);                                 return mfVBat[lu8Idx - 1]; break;
      case 2: mfVBat[lu8Idx - 1] = fGetBatVoltageAbs(lu8Idx) - fGetBatVoltageAbs(lu8Idx - 1); return mfVBat[lu8Idx - 1]; break;
      case 3: mfVBat[lu8Idx - 1] = fGetBatVoltageAbs(lu8Idx) - fGetBatVoltageAbs(lu8Idx - 1); return mfVBat[lu8Idx - 1]; break;
      case 4: mfVBat[lu8Idx - 1] = fGetBatVoltageAbs(lu8Idx) - fGetBatVoltageAbs(lu8Idx - 1); return mfVBat[lu8Idx - 1]; break;
    }
    return 0;
  }


  void vUpdate_S1_Lipo()
  {
    // Battery Main Switch
    // If any Lipo is below enLipoUThres1 for 1s and not charging, then turn off the lipo
    u8 lui8t;
    i16 lui16Volt;

    switch (lenSmS[enS1_Lipo])
    {
      case enSmStOff:
        for (lui8t = 0; lui8t < 4; lui8t++)
        {
          lui16Volt = i16GetBatVoltageRel(lui8t + 1);

          if (lui16Volt > RomConst_stDevice_Info->u16VoltLipoOff)
          {
            mu16UnderVoltageCnt[lui8t] += 10;
            if (mu16UnderVoltageCnt[lui8t] >= RomConst_stDevice_Info->u16TimeOutBalancer) // Undervoltage detected for >1s
            {
              mS_Lipo.vSet1();
              mu16UnderVoltageCnt[lui8t] = RomConst_stDevice_Info->u16TimeOutBalancer;
              lenSmS[enS1_Lipo] = enSmStOn;
            }
          }
          else
          {
            mu16UnderVoltageCnt[lui8t] = 0;
          }
        }
        break;
      case enSmStOn:
        for (lui8t = 0; lui8t < 4; lui8t++)
        {
          lui16Volt = i16GetBatVoltageRel(lui8t + 1);

          if (lui16Volt < RomConst_stDevice_Info->u16VoltLipoOff)
          {
            mu16UnderVoltageCnt[lui8t] += 10;
            if ((mu16UnderVoltageCnt[lui8t] >= RomConst_stDevice_Info->u16TimeOutBalancer) && // Undervoltage detected for >1s
              (mi32IShunt[1] < 0)) // Battery is discharging
            {
              mS_Lipo.vSet0();
              mu16UnderVoltageCnt[lui8t] = RomConst_stDevice_Info->u16TimeOutBalancer;
              lenSmS[enS1_Lipo] = enSmStOff;
            }
          }
          else
          {
            mu16UnderVoltageCnt[lui8t] = 0;
          }
        }
        break;
    }
  }

  void vUpdate_S_Balancer(u8 lu8Idx)
  {
    i16 lui16Volt;

    if ((lu8Idx >= 1) && (lu8Idx <= 4))
    {

      lui16Volt = i16GetBatVoltageRel(lu8Idx);

      switch (lenSmS[lu8Idx])
      {
        case enSmStOff:
          if (lui16Volt > RomConst_stDevice_Info->u16VoltBalance)
          {
            mu16OverVoltageCnt[lu8Idx-1] += 10;;
            if (mu16OverVoltageCnt[lu8Idx - 1] >= RomConst_stDevice_Info->u16TimeOutBalancer) // Overvoltage detected for >1s
            {
              mu16OverVoltageCnt[lu8Idx - 1] = RomConst_stDevice_Info->u16TimeOutBalancer;
              if (mi32IShunt[1] > 0) // Battery is charging
              {
                switch (lu8Idx)
                {
                  case 1: mS_BalancerLipo1.vSet1(); mBalancingActive |= 1; break;
                  case 2: mS_BalancerLipo2.vSet1(); mBalancingActive |= 2; break;
                  case 3: mS_BalancerLipo3.vSet1(); mBalancingActive |= 4; break;
                  case 4: mS_BalancerLipo4.vSet1(); mBalancingActive |= 8; break;
                }
                lenSmS[lu8Idx] = enSmStOn;
                mu16OverVoltageCnt[lu8Idx-1] = 0;
              }
            }
          }
          break;
        case enSmStOn:
          mu16UnderVoltageCnt[lu8Idx - 1] = 0;
          if (lui16Volt < RomConst_stDevice_Info->u16VoltBalance)
          {
            mu16OverVoltageCnt[lu8Idx - 1] += 10;;
            if (mu16OverVoltageCnt[lu8Idx - 1] >= RomConst_stDevice_Info->u16TimeOutBalancer) // Exit Overvoltage detected for >1s
            {
              switch (lu8Idx)
              {
                case 1: mS_BalancerLipo1.vSet0(); mBalancingActive &= (255 - 1); break;
                case 2: mS_BalancerLipo2.vSet0(); mBalancingActive &= (255 - 2); break;
                case 3: mS_BalancerLipo3.vSet0(); mBalancingActive &= (255 - 4); break;
                case 4: mS_BalancerLipo4.vSet0(); mBalancingActive &= (255 - 8); break;
              }
              lenSmS[lu8Idx] = enSmStOff;
              mu16OverVoltageCnt[lu8Idx - 1] = 0;
            }
          }
        break;
      }
    }
  }



  void vUpdateCharger()
  {
    lenSmLipoPrev = lenSmLipo;

    {
      i16 li16I_ChargerLimit;
      i16 li16U_ChargerLimit;
      i16 li16I_SupplyLimit;

      u8 lui8t;
      i16 lui16SupplyCurrent;
      i16 lui16SupplyVolt;
      i16 lui16BatteryVolt;
      i16 lui16BatteryCurrent;


      lui16SupplyVolt    = mfVBusAvg[0];
      lui16SupplyCurrent = mfIShuntAvg[0];
      lui16BatteryVolt    = mfVBusAvg[1];
      lui16BatteryCurrent = mfIShuntAvg[1];

      li16I_ChargerLimit = RomConst_stDevice_Info->u16MaxCurrentBat;
      li16U_ChargerLimit = RomConst_stDevice_Info->u8CellCnt * RomConst_stDevice_Info->u16MaxVoltCell;
      li16I_SupplyLimit  = RomConst_stDevice_Info->u16MaxCurrentInput;

      for (u8 lu8CellIdx = 1; lu8CellIdx <= RomConst_stDevice_Info->u8CellCnt; lu8CellIdx++)
      {
        if (i16GetBatVoltageRel(lu8CellIdx) < RomConst_stDevice_Info->u16VoltCellDefect)
        {
          lenSmLipo = enSmStNotCharging_Error_CellsDefect;
          mcPowerIn.vSetVoltage(RomConst_stDevice_Info->u16VoltMinPowerIn);
          mcPowerIn.vDisable();
          return;
        }
      }

      //Überprüfen, ob es eine Eingangsspannung gibt
      if (lui16SupplyVolt < RomConst_stDevice_Info->u16VoltMinSupply)
      {
        lenSmLipo = enSmStNotCharging_Error_LowInputVoltage;
        mcPowerIn.vSetVoltage(RomConst_stDevice_Info->u16VoltMinPowerIn);
        mcPowerIn.vDisable();
        return;
      }

      // Während Laden nicht runterfahren.
      if ((lenSmLipo == enSmStChargingNormal) ||
          (lenSmLipo == enSmStChargingSave))
      {
        lenSmLipo = enSmStChargingNormal;

