buzzwang1/pcb/source/main/STM32L433CCT/Mini/Test/BTR/BoardCtrl.h
        // Falls eine Zelle Unterspannung hat, dann Ladestrom begrenzen
        for (lui8t = 1; lui8t <= RomConst_stDevice_Info->u8CellCnt; lui8t++)
        {
          lui16BatteryVolt = i16GetBatVoltageRel(lui8t);
          if (lui16BatteryVolt < enLipoUThres1)
          {
            li16I_ChargerLimit = enLipoISave;
            lenSmLipo = enSmStChargingSave;
          }
        }

        if (mBalancingActive)
        {
          li16I_ChargerLimit = enLipoISave;
          lenSmLipo = enSmStChargingSave;
        }

        lui16SupplyCurrent = mfIShuntAvg[0];
        lui16BatteryVolt    = mfVBusAvg[1];
        lui16BatteryCurrent = mfIShuntAvg[1];


        if ((lui16BatteryVolt < li16U_ChargerLimit) &&
            (lui16BatteryCurrent < li16I_ChargerLimit) &&
            (lui16SupplyCurrent < li16I_SupplyLimit))
        {
          i16 lui16BatteryVoltTemp;
          lui16BatteryVoltTemp = mcPowerIn.mVoltage_mV + 1;
          if (lui16BatteryVoltTemp >= RomConst_stDevice_Info->u16VoltMaxPowerIn) lui16BatteryVoltTemp = RomConst_stDevice_Info->u16VoltMaxPowerIn;
          mcPowerIn.vSetVoltage(lui16BatteryVoltTemp);
          mcPowerIn.vEnable();
        }
        else
        {
          i16 lui16BatteryVoltTemp;
          lui16BatteryVoltTemp = mcPowerIn.mVoltage_mV - 1;
          if (lui16BatteryVoltTemp <= RomConst_stDevice_Info->u16VoltMinPowerIn) lui16BatteryVoltTemp = RomConst_stDevice_Info->u16VoltMinPowerIn;
          mcPowerIn.vSetVoltage(lui16BatteryVoltTemp);
          mcPowerIn.vEnable();
        }

        if ((lui16BatteryVolt >= li16U_ChargerLimit - 10) && // Geladen ?
            (lui16BatteryVolt <= li16U_ChargerLimit + 10) &&
            (lui16BatteryCurrent < enLipoISave))
        {
          mu32ChargerReadyCnt += 10;

          if (mu32ChargerReadyCnt > RomConst_stDevice_Info->u16TimeOutCharger)
          {
            mu32ChargerReadyCnt = 0;
            i16 lui16BatteryVoltTemp;
            lui16BatteryVoltTemp = mcPowerIn.mVoltage_mV - RomConst_stDevice_Info->u8CellCnt * RomConst_stDevice_Info->u16VoltPowerInCharged;
            mcPowerIn.vSetVoltage(lui16BatteryVoltTemp);
            mcPowerIn.vEnable();
            lenSmLipo = enSmStCharged;
          }
        }
        else
        {
          mu32ChargerReadyCnt = 0;
        }
      }
      else
        //if (lenSmLipo == enSmStCharged)
        {
          if (lui16BatteryVolt < li16U_ChargerLimit-500)
          {
            lenSmLipo = enSmStChargingNormal;
          }
        }
    }
  }

  void vUpdateAll(bool bIsAuto)
  {
    if (!mbPowerDown)
    {
      uint8 lui8t;
      uint8 lui8i;

      float lfInputFactor;

      lfInputFactor = RomConst_stDevice_Info->fP_In;

      // Strom und Spannung einlesen
      for (lui8t = 0; lui8t <= 1; lui8t++)
      {
        for (lui8i = 1; lui8i <= 3; lui8i++)
        {
          uint8 lui8Idx = 3 * lui8t + (lui8i - 1);

          mcP[lui8t]->i8ReadVShunt_digit(lui8i);
          mcP[lui8t]->i8ReadVBus_digit(lui8i);


          mi32VBus[lui8Idx]   = mcP[lui8t]->i32CalcVBus_uV(lui8i)   / 1000;
          mi32IShunt[lui8Idx] = mcP[lui8t]->i32CalcIShunt_uA(lui8i) / 1000;
          mi32VShunt[lui8Idx] = mcP[lui8t]->i32CalcVShunt_uV(lui8i) / 1000;

          float lfError = (mcP[lui8t]->i32CalcVBus_uV(lui8i) / 1000.0f - mfVBusAvg[lui8Idx]);
          mfVBusAvg[lui8Idx] = mfVBusAvg[lui8Idx] + lfError * lfInputFactor;

          lfError = (mcP[lui8t]->i32CalcIShunt_uA(lui8i) / 1000.0f - mfIShuntAvg[lui8Idx]);
          mfIShuntAvg[lui8Idx] = mfIShuntAvg[lui8Idx] + lfError * lfInputFactor;

          lfError = (mcP[lui8t]->i32CalcVShunt_uV(lui8i) / 1000.0f - mfVShuntAvg[lui8Idx]);
          mfVShuntAvg[lui8Idx] = mfVShuntAvg[lui8Idx] + lfError * lfInputFactor;
        }
      }

      for (lui8i = 1; lui8i <= 4; lui8i++)
      {
        fGetBatVoltageRel(lui8i);
      }

      /*if ((mu16Startup_Delay == 0) && (bIsAuto))
      {
        //Schalter setzten
        vUpdate_S1_Lipo();
        vUpdateCharger();
        for (u8 lu8CellIdx = 1; lu8CellIdx <= RomConst_stDevice_Info->u8CellCnt; lu8CellIdx++)
        {
          if (lenSmLipo != enSmStNotCharging_Error_CellsDefect)
          {
            vUpdate_S_Balancer(lu8CellIdx);
          }
        }
      }
      else
      {
        if (mu16Startup_Delay > 10) mu16Startup_Delay -= 10;
                               else mu16Startup_Delay  = 0;
      }*/
    }
    else
    {
      if (mbPowerDownEnter)
      {
        mbPowerDownEnter = False;

        mS_BalancerLipo1.vSet0();
        mS_BalancerLipo2.vSet0();
        mS_BalancerLipo3.vSet0();
        mS_BalancerLipo4.vSet0();

        mcPowerOut.vDisable();
        mcPowerIn.vDisable();
      }
    }

  }
};



#endif  //__BOARD_CONTROL_H__
